a6-insert-and-read-fromdatabase-mysql/app/controllers/employee_controller.rb

  def index
    # Read all records from customer tables
    @customers = Customer.all

    # Print name of each customer on console
    @customers.each do |cu|
---
SELECT `devdb`.`customers`.* FROM `devdb`.`customers`

  def find
    # Search for record with provided customer id.
    @customers = Customer.where("cust_id = ?", params[:cust_id]).select("id, cust_id, name, mobile, email")

    # Print object
    puts @customers

    # Print name of each customer on console
    @customers.each do |cu|
---
SELECT id, cust_id, name, mobile, email FROM `devdb`.`customers` WHERE (cust_id = '101')